# Project 3

### Data

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import sys

import sqlite3

### 1. Load data from sqlite

In [2]:
# Create a SQL connection to our SQLite database
con = sqlite3.connect("Chinook_Sqlite.sqlite")


query = '''SELECT C.FirstName, C.LastName, T.Name, A.Title
            FROM Customer C
            join Invoice I on C.CustomerId = I.CustomerId
            join InvoiceLine IL on IL.InvoiceId = I.InvoiceId
            join Track T on T.TrackId = IL.TrackId
            join Album A on A.AlbumId = T.AlbumId
            order by LastName, FirstName
            ;'''
df = pd.read_sql_query(query, con)

df

,FirstName,LastName,Name,Title
0,Roberto,Almeida,Right Next Door to Hell,Use Your Illusion I
1,Roberto,Almeida,In The Evening,In Through The Out Door
2,Roberto,Almeida,Fool In The Rain,In Through The Out Door
3,Roberto,Almeida,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Roberto,Almeida,Caso Você Queira Saber,Minas
...,...,...,...,...
2235,Fynn,Zimmermann,Nothin' To Lose,Unplugged [Live]
2236,Fynn,Zimmermann,Since I've Been Loving You,BBC Sessions [Disc 2] [Live]
2237,Fynn,Zimmermann,Going To California,BBC Sessions [Disc 2] [Live]
2238,Fynn,Zimmermann,We're Gonna Groove,Coda
2239,Fynn,Zimmermann,Ozone Baby,Coda